org/visual_code_walk_through.org
#+setupfile:./hugo_setup.org
#+hugo_slug: visual_code_walk_through
#+TITLE: Visual code walk through
#+roam_tags: CDN

Ray is working on a visual code walk through.

* General evaluation strategy for these demos:

- /‘Would anyone want to use this?’/
- E.g., in the case of Emacs "learn X in Y" demo.
- If there is interest, work up to covering the HtDP book

* Related work

- MAUDE framework. :: You describe your programming language using
  rewrite rules in K.  They define tools to auto-derive rules in [[http://www.kframework.org/index.php/Projects][K]].

- Program slicing :: ‘Galois connection on the traces’. This allows
  you to find where bugs appeared.  People tend to look in the most
  recent.  Imagine a call-graph of all the variables, so it gives you
  a minimum trace, showing where your bug can be found.


* Next steps 

- [[file:teach_basic_coding.org][Teach basic coding]]
